/************************************************************
 * 版权：2025CIMC Copyright。 
 * 文件：Function.c
 * 作者: Jialei Zhao
 * 平台: 2025CIMC IHD-V04
 * 版本: Jialei Zhao     2025/12/30     V0.01    original
************************************************************/


/************************* 头文件 *************************/

#include "Function.h"
#include "usart.h"

/************************* 宏定义 *************************/


/************************ 变量定义 ************************/


/************************ 函数定义 ************************/



/************************************************************ 
 * Function :       System_Init
 * Comment  :       用于初始化MCU
 * Parameter:       null
 * Return   :       null
 * Author   :       Jialei Zhao
 * Date     :       2025-12-30 V0.1 original
************************************************************/

void System_Init(void)
{
	systick_config();     // 时钟配置

	usart_init();			// 串口初始化

}

/************************************************************ 
 * Function :       UsrFunction
 * Comment  :       用户程序功能: 串口通过中断发送字符串
 * Parameter:       null
 * Return   :       null
 * Author   :       Jialei Zhao
 * Date     :       2025-12-30 V0.1 original
************************************************************/

void UsrFunction(void)
{
	while(1)
	{
		
		printf("hello world!\r\n");
		
		delay_1ms(500);
	
	}
}


/****************************End*****************************/

