/************************************************************
 * 版权：2025CIMC Copyright。 
 * 文件：fwdgt.h
 * 作者: Jialei Zhao
 * 平台: 2025CIMC IHD-V04
 * 版本: Jialei Zhao     2025/12/29      V0.01    original
************************************************************/
#ifndef __KEY_H__
#define __KEY_H__

/************************* 头文件 *************************/
#include "HeaderFiles.h"

/************************* 宏定义 *************************/
#define KEY_RCU RCU_GPIOE
#define KEY_PORT GPIOE
#define KEY4 GPIO_PIN_4
#define KEY2 GPIO_PIN_2

/************************ 变量定义 ************************/

/************************ 函数定义 ************************/

void KEY_Init(void);

#endif // !__KEY_H__

/****************************End*****************************/
