/************************************************************
 * 版权：2025CIMC Copyright。 
 * 文件：Function.c
 * 作者: Jialei Zhao 
 * 平台: 2025CIMC IHD-V04
 * 版本: Jialei Zhao     2026/1/4     V0.01    original
************************************************************/


/************************* 头文件 *************************/

#include "Function.h"
#include "timer.h"

/************************* 宏定义 *************************/


/************************ 变量定义 ************************/


/************************ 函数定义 ************************/



/************************************************************ 
 * Function :       System_Init
 * Comment  :       用于初始化MCU
 * Parameter:       null
 * Return   :       null
 * Author   :       Jialei Zhao
 * Date     :       2026-01-04 V0.1 original
************************************************************/

void System_Init(void)
{
	systick_config();     // 时钟配置
	my_timer_init();
	
}
/************************************************************ 
 * Function :       UsrFunction
 * Comment  :       用户程序功能: 通过基本定时器的更新中断来使LED3进行周期闪烁
 * Parameter:       null
 * Return   :       null
 * Author   :       Jialei Zhao
 * Date     :       2026-01-04 V0.1 original
************************************************************/

void UsrFunction(void)
{
	
	
	while(1)
	{
		
		
	
	}
}


/****************************End*****************************/

