/************************************************************
 * 版权：2025CIMC Copyright。 
 * 文件：Function.c
 * 作者: Lingyu Meng
 * 平台: 2025CIMC IHD-V04
 * 版本: Lingyu Meng     2025/2/16     V0.01    original
************************************************************/


/************************* 头文件 *************************/

#include "Function.h"

/************************* 宏定义 *************************/


/************************ 变量定义 ************************/


/************************ 函数定义 ************************/



/************************************************************ 
 * Function :       System_Init
 * Comment  :       用于初始化MCU
 * Parameter:       null
 * Return   :       null
 * Author   :       Lingyu Meng
 * Date     :       2025-02-30 V0.1 original
************************************************************/

void System_Init(void)
{
	systick_config();     // 时钟配置
	
	LED_Init();			// 初始化LED端口
	
	KEY_Init();			// 初始化KEY端口
	
	EXTI_PIN_Init();	// 初始化中断
	
}

/************************************************************ 
 * Function :       UsrFunction
 * Comment  :       用户程序功能: LED1闪烁
 * Parameter:       null
 * Return   :       null
 * Author   :       Lingyu Meng
 * Date     :       2025-02-30 V0.1 original
************************************************************/

void UsrFunction(void)
{
	
	
	// 实现LED1闪烁
	// LED2关联到外部KEY中断，按下后实现LED2翻转
	while(1)
	{
//		 LED1_OFF();
//		 LED2_ON();
//		
//		 delay_1ms(200);
//		
//		 LED1_ON();
//		 LED2_OFF();
//		
//		delay_1ms(200);
		
	
	}
}


/****************************End*****************************/

